; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v4 ?v1)
             (pred_10 ?v11 ?v13)
             (pred_2 ?v4 ?v13)
             (pred_8 ?v3 ?v4 )
	     (pred_9 ?v4)
             (pred_3 ?v8)
             (pred_5 ?v11)
             (pred_1 ?v13)
             (pred_11 ?v4)
             (pred_6 ?v11)
             (pred_12 ?v4)
             (pred_4 ))



(:action op_3
:parameters (?v10 ?v7 ?v9 ?v2)
:precondition (and (pred_3 ?v10) (pred_3 ?v7) (pred_5 ?v9) (pred_1 ?v2)
          (pred_7 ?v10 ?v7) (pred_10 ?v9 ?v2)
                   (pred_2 ?v7 ?v2) (pred_9 ?v10) 
                   (pred_11 ?v7) (pred_6 ?v9))
:effect (and  (pred_12 ?v7) (not (pred_11 ?v7))))


(:action op_2
:parameters (?v10 ?v12)
:precondition (and (pred_3 ?v10) (pred_3 ?v12)
               (pred_9 ?v10) (pred_7 ?v10 ?v12) (pred_12 ?v12))
:effect (and (pred_9 ?v12) (not (pred_9 ?v10))))

(:action op_5
:parameters (?v10 ?v9)
:precondition (and (pred_3 ?v10) (pred_5 ?v9) 
                  (pred_9 ?v10) (pred_8 ?v9 ?v10) (pred_4 ))
:effect (and (pred_6 ?v9)
   (not (pred_8 ?v9 ?v10)) (not (pred_4 ))))


(:action op_4
:parameters (?v10 ?v5 ?v6)
:precondition (and (pred_3 ?v10) (pred_5 ?v5) (pred_5 ?v6)
                  (pred_9 ?v10) (pred_6 ?v6) (pred_8 ?v5 ?v10))
:effect (and (pred_6 ?v5) (pred_8 ?v6 ?v10)
        (not (pred_6 ?v6)) (not (pred_8 ?v5 ?v10))))

(:action op_1
:parameters (?v10 ?v9)
:precondition (and (pred_3 ?v10) (pred_5 ?v9) 
                  (pred_9 ?v10) (pred_6 ?v9))
:effect (and (pred_4 ) (pred_8 ?v9 ?v10) (not (pred_6 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_16 obj_07 obj_06 obj_10 obj_08 obj_17 obj_11 obj_15 obj_05 obj_09 obj_14 obj_03 obj_13 obj_04 obj_02 obj_19
    obj_01 obj_12
    obj_20 obj_18
    )

    (:init
       (pred_4)

       (pred_3 obj_16)
       (pred_3 obj_07)
       (pred_3 obj_06)
       (pred_3 obj_10)
       (pred_3 obj_08)
       (pred_3 obj_17)
       (pred_3 obj_11)
       (pred_3 obj_15)
       (pred_3 obj_05)
       (pred_3 obj_09)
       (pred_3 obj_14)
       (pred_3 obj_03)
       (pred_3 obj_13)
       (pred_3 obj_04)
       (pred_3 obj_02)
       (pred_3 obj_19)
       (pred_1 obj_01)
       (pred_1 obj_12)
       (pred_5 obj_20)
       (pred_5 obj_18)

       (pred_7 obj_16 obj_08)
       (pred_7 obj_16 obj_07)
       (pred_7 obj_07 obj_17)
       (pred_7 obj_07 obj_06)
       (pred_7 obj_07 obj_16)
       (pred_7 obj_06 obj_11)
       (pred_7 obj_06 obj_10)
       (pred_7 obj_06 obj_07)
       (pred_7 obj_10 obj_15)
       (pred_7 obj_10 obj_06)
       (pred_7 obj_08 obj_05)
       (pred_7 obj_08 obj_17)
       (pred_7 obj_08 obj_16)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_17 obj_11)
       (pred_7 obj_17 obj_07)
       (pred_7 obj_17 obj_08)
       (pred_7 obj_11 obj_14)
       (pred_7 obj_11 obj_15)
       (pred_7 obj_11 obj_06)
       (pred_7 obj_11 obj_17)
       (pred_7 obj_15 obj_03)
       (pred_7 obj_15 obj_10)
       (pred_7 obj_15 obj_11)
       (pred_7 obj_05 obj_13)
       (pred_7 obj_05 obj_09)
       (pred_7 obj_05 obj_08)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_09 obj_14)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_09 obj_05)
       (pred_7 obj_14 obj_02)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_14 obj_11)
       (pred_7 obj_14 obj_09)
       (pred_7 obj_03 obj_19)
       (pred_7 obj_03 obj_15)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_13 obj_04)
       (pred_7 obj_13 obj_05)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_13)
       (pred_7 obj_02 obj_19)
       (pred_7 obj_02 obj_14)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_19 obj_03)
       (pred_7 obj_19 obj_02)
       (pred_11 obj_05)
       (pred_11 obj_10)
       (pred_2  obj_05 obj_01)
       (pred_2  obj_10 obj_12)
       (pred_12 obj_16)
       (pred_12 obj_07)
       (pred_12 obj_06)
       (pred_12 obj_08)
       (pred_12 obj_17)
       (pred_12 obj_11)
       (pred_12 obj_15)
       (pred_12 obj_09)
       (pred_12 obj_14)
       (pred_12 obj_03)
       (pred_12 obj_13)
       (pred_12 obj_04)
       (pred_12 obj_02)
       (pred_12 obj_19)

       (pred_10  obj_20 obj_01)
       (pred_10  obj_18 obj_12)
       (pred_8 obj_20 obj_14)
       (pred_8 obj_18 obj_11)
       (pred_9 obj_04)
    )

    (:goal (and
       (pred_8 obj_20 obj_04)
    ))
(:constraints
  (always (not (pred_9 obj_09)))
)
)

; plan
1. (op_2 obj_04 obj_02)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_02)
   goals met: 0 of 1
2. (op_2 obj_02 obj_14)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_14)
   goals met: 0 of 1
3. (op_5 obj_14 obj_20)
   deleted: (pred_8 obj_20 obj_14) (pred_4)
   added: (pred_6 obj_20)
   goals met: 0 of 1
4. (op_2 obj_14 obj_02)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_02)
   goals met: 0 of 1
5. (op_2 obj_02 obj_04)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_04)
   goals met: 0 of 1
6. (op_1 obj_04 obj_20)
   deleted: (pred_6 obj_20)
   added: (pred_4) (pred_8 obj_20 obj_04)
   goals met: 1 of 1
